'''Задание 1. Создайте список случайно сгенерированных чисел от 1 до 100. На
основе этого списка создайте второй, который будет содержать слова “High”
("высокий”) или “Low” ("низкий") в зависимости от того, больше или меньше
соответствующее число исходного списка некого порогового значения (само
значение порога должно быть задано вами произвольно как значение переменной).'''

import random

random_numbers = [random.randint(1, 100) for _ in range(20)]
threshold = 50

high_low = ['High' if number > threshold else 'Low' for number in random_numbers]
print("Список чисел:", random_numbers)
print("Список High/Low:", high_low)
print()
'''Задание 2. Создайте список из 100 имен. Для генерации 100 имен можно
воспользоваться примером из прошлого модуля Random_names.py в котором
применялся модуль names (его потребуется инсталлировать с помощью pip). На
основе этого списка имен создайте два новых списка. Один с именами, где первый
символ начинается с буквы между “А” и “М”, а другой – содержит остальные имена.'''

import names

random_names = [names.get_full_name() for _ in range(100)]

names_A_M = [name for name in random_names if 'A' <= name[0] <= 'M']
names_N_Z = [name for name in random_names if name[0] > 'M']

print("Имена от A до M:", names_A_M)
print("Остальные имена:", names_N_Z)
print()

'''Задание 3. Акростих. Пользователь вводит в консоль слова по одному. Когда
пользователь введет пустую строку (что означает окончание ввода), программа
должна вывести слово, составленное из первых букв введенных пользователем слов. '''

print("Введите слова для акростиха. Для завершения введите пустую строку.")

acrostic = []
while True:
    word = input("Введите слово: ")
    if word == "":
        break
    acrostic.append(word[0])

acrostic_word = ''.join(acrostic)
print("Акростих:", acrostic_word)
